In [ ]:
#pandas 모듈 import
#train.csv 파일 load
#맨앞 3건 display

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
#dataframe의 형태 확인하기 ...행수와 열수를 튜플로 반환

(891, 12)

In [ ]:
#칼럼의 타입, Null 데이터개수, 데이터의 분포 등의 ㅁ타데이터 조회

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [ ]:
#숫자형 칼럼에 대한 데이터의 분포도 확인

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
#Pclass 칼럼의 데이터 건수 출력

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
#Pclass 칼럼의 타입

pandas.core.series.Series

In [14]:
#Pclass칼럼의 일부(3건)

0    3
1    1
2    3
Name: Pclass, dtype: int64

In [ ]:
#Dataframe과 리스트, Numpy의 ndarray 상호변환

In [ ]:
# Numpy의 ndarray, 리스트, 딕셔너리로 DataFrame으로 변환하기

In [ ]:
#1차원

In [26]:
import numpy as np
col_name = ["칼럼1"]
mylist = [10,20,30,40]

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'>

   칼럼1
0   10
1   20
2   30
3   40

In [ ]:
#2차원

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'>

   칼럼1  칼럼2  칼럼3  칼럼4
0   10   20   30   40
1   50   60   70   80

In [ ]:
#Dictionary로 dataframe만들기

<class 'pandas.core.frame.DataFrame'>

   칼럼1  칼럼2
0   10   50
1   20   60
2   30   70
3   40   80

In [ ]:
#DataFrame을 ndarray, list, dictionary로 변경하기 
#DataFrame->ndarray
#DataFrame->list
#DataFrame->dictionary

In [ ]:
#DataFrame->ndarray

2 차원
(891, 12)
타입: <class 'numpy.ndarray'>
[[1 0 3 ... 7.25 nan 'S']
 [2 1 1 ... 71.2833 'C85' 'C']
 [3 1 3 ... 7.925 nan 'S']
 ...
 [889 0 3 ... 23.45 nan 'S']
 [890 1 1 ... 30.0 'C148' 'C']
 [891 0 3 ... 7.75 nan 'Q']]

In [ ]:
#DataFrame->list

타입: <class 'list'>
0번째 data: [1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171', 7.25, nan, 'S']

In [ ]:
#DataFrame->dictionary

타입: <class 'dict'>
data: Braund, Mr. Owen Harris

In [ ]:
#DataFrame의 칼럼 데이터 세트 생성과 수정 
#mycol 칼럼에 일괄적으로 0을 입력한다.
#mycol2 칼럼에 Age칼럼의 값을 10으로 나눈 몫을 입력한다.
#mycol3 칼럼에 SibSp칼럼과 Parch칼럼의 값을 더하고 추가로 1을 더하여 가족수를 입력한다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mycol,mycol2,mycol3
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,2.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,3.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,2.0,1

In [ ]:
#dataframe의 data삭제
#axis  ---- 0은 row방향, 1은 칼럼방향이다. 
#inplace --- true로 설정하면 본래의 dataframe을 변경한다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [83]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mycol,mycol2,mycol3
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,0,2.0,2

In [86]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
#index 객체 ... index는 식별용으로 사용된다.

In [98]:

print("index객체:", )
print("index의 값들의 타입:", )
print("index 값들의 형태(1차원배열):",)
print("inex값들 20개:", )
print("index 5번째 값:", )

index객체: RangeIndex(start=0, stop=891, step=1)
index의 값들의 타입: <class 'numpy.ndarray'>
index 값들의 형태(1차원배열): (891,)
inex값들 20개: [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19]
index 5번째 값: 5

In [ ]:
#Series 연산

In [114]:
print("최대 Fare:",  )
print("최소 Fare:",  )
print("합계 Fare:", )
print("합계 Fare:",  )
print("앞부분3건 Fare:\n",  )
print("앞부분3건 Fare+3 타입 :\n", )
print("앞부분3건 Fare+3 타입 :\n", )

최대 Fare: 512.3292
최소 Fare: 0.0
합계 Fare: 28693.9493
합계 Fare: 28693.9493
앞부분3건 Fare:
 0     7.2500
1    71.2833
2     7.9250
Name: Fare, dtype: float64
앞부분3건 Fare+3 타입 :
 <class 'pandas.core.series.Series'>
앞부분3건 Fare+3 타입 :
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [115]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
#DataFrame 또는 Series에 reset_index() .....새롭게 index를 연속 숫자형으로 할당
#기존index는 index이름으로 추가되고 새로운 index가 생성됨

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [134]:
result = df["Pclass"].value_counts()
print("타입:", type(result))
print("index는 :" , result.index)
df2 = result.reset_index()  #결과는 dataframe으로 된다. 
print("타입:", type(df2))
df2

타입: <class 'pandas.core.series.Series'>
index는 : Int64Index([3, 1, 2], dtype='int64')
타입: <class 'pandas.core.frame.DataFrame'>

   index  Pclass
0      3     491
1      1     216
2      2     184

In [ ]:
#DataFrame의 []연산자 ......칼럼지정연산자 
#Name칼럼5건 ....[칼럼명]으로 사용하면 Series
#Name과 Age칼럼5건 ....[칼럼명,칼럼명]으로 사용하면 DataFrame

pandas.core.series.Series

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [ ]:
#위의 index를 1부터 시작하는 index로 변경해보자
#DataFrame의 loc[]연산자 ---명칭기반 index만 가능 
#index=1인 row추출

,old_index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [151]:
#index=1인 row추출

old_index                            0
PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 1, dtype: object

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [ ]:
#DataFrame의 iloc[]연산자  ~ 위치기반의 indexing만 허용 
#0 index에 3번째 칼럼 
#0~2 index의 3번째 칼럼

In [155]:
#0 index에 3번째 칼럼

'Braund, Mr. Owen Harris'

In [165]:
#0~2 index의 3번째 칼럼

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
Name: Name, dtype: object

In [163]:
#명칭기반 ~ 0 index의 Name칼럼

'Braund, Mr. Owen Harris'

In [164]:
#명칭기반 ~ 0부터 2index의 Name칼럼

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [ ]:
#boolean기반 인덱싱
#Age가 70이상인 모든데이터

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [180]:
#Age가 70이상인 모든데이터 (Name	Age 칼럼)

                                     Name   Age
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0

In [ ]:
#Age > 70 이고 Pclass=3이고 Embarked가 'S'인 승객은 ?

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.775,NaN,S

In [ ]:
#정렬, Aggregation함수, GroupBy적용

In [186]:
#Name으로 sort

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [189]:
#"SibSp","Pclass" 으로 sort

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

In [2]:
#"SibSp","Pclass" 으로 descending SORT

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.55,NaN,S
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.55,NaN,S
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.55,NaN,S

In [ ]:
#Aggression 함수 적용
#1. 각 칼럼의 갯수를 출력한다. (null은 자동제외됨)
#2. Fare 칼럼의 평균값 출력한다.
#3. Fare와 Age칼럼의 평균값 출력한다.

In [3]:
#1. 각 칼럼의 갯수를 출력한다. (null은 자동제외됨)

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [5]:
#2. Fare 칼럼의 평균값 출력한다.

32.204207968574636

In [6]:
#3. Fare와 Age칼럼의 평균값 출력한다.

Fare    32.204208
Age     29.699118
dtype: float64

In [ ]:
#groupby적용
# Pclass별 각 칼럼의 count출력
# Pclass별 Sex별 각 칼럼의 count출력
# Pclass별 Sex별로 group하여 "PassengerId","Survived"칼럼의 count를 출력 
# Pclass별로 group하여 최대나이와 최소나이 출력 
# Pclass별 로 group하여 최대나이와 최소나이 출력

In [7]:
df.groupby("Pclass")

In [8]:
# Pclass별 각 칼럼의 count출력

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [9]:
# Pclass별 Sex별 각 칼럼의 count출력

               PassengerId  Survived  Name  Age  SibSp  Parch  Ticket  Fare  \
Pclass Sex
1      female           94        94    94   85     94     94      94    94
       male            122       122   122  101    122    122     122   122
2      female           76        76    76   74     76     76      76    76
       male            108       108   108   99    108    108     108   108
3      female          144       144   144  102    144    144     144   144
       male            347       347   347  253    347    347     347   347

               Cabin  Embarked
Pclass Sex
1      female     81        92
       male       95       122
2      female     10        76
       male        6       108
3      female      6       144
       male        6       347

In [10]:
# Pclass별 Sex별로 group하여 "PassengerId","Survived"칼럼의 count를 출력 
)

               PassengerId  Survived
Pclass Sex
1      female           94        94
       male            122       122
2      female           76        76
       male            108       108
3      female          144       144
       male            347       347

In [13]:
# Pclass별 로 group하여 최대나이와 최소나이 출력

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [14]:
# Pclass별 로 group하여 최대나이와 최소나이 출력

         Age       Fare  SibSp
Pclass
1       80.0  84.154687     90
2       70.0  20.662183     74
3       74.0  13.675550    302

In [ ]:
#결손데이터 처리
#NaN여부 확인은 isna()
#NaN값을 다른 값으로 대체는 fillna()
#모든데이터에 대해 NaN여부 확인하고 상위3건 출력
#모든데이터에 대해 NaN여부 확인 ~ 각각의 칼럼의 null갯수 확인

In [16]:
#모든데이터에 대해 NaN여부 확인하고 상위3건 출력

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [17]:
#모든데이터에 대해 NaN여부 확인 ~ 각각의 칼럼의 null갯수 확인

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
#결손데이터 대체하기 
#Cabin 칼럼의 결손데이터를 C000으로 대체한다.

0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C000,S

In [24]:
#결손데이터 대체하기 
#Age 칼럼의 결손데이터를 나이칼럼의 평균으로 대체한다.

#나이 칼럼의 평균출력

29.69911764705882

In [29]:
#Age 칼럼의 결손데이터를 나이칼럼의 평균으로 대체한다.

0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.00,C000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.45,C000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.75,C000,Q

In [ ]:
#apply lambda식으로 데이터 가공하기

In [30]:
def get_sqare(a):
    return a**2

In [31]:
get_sqare(3)

9

In [32]:
myf = lambda x : x**2

In [34]:
mydata = [1,2,3]
list(map(myf, mydata))

[1, 4, 9]

In [35]:
#Name칼럼의 길이를 구해서 Name_len칼럼을 추가한다.

In [36]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_len
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S,22

In [37]:
#if Age <=15 이면  "Child"" 
#if Age>15 and Age<60 "Adult"
#if x>60 "Elderly"

df["Age_cat"] =

In [47]:
df.loc[160:175, ["Age", "Age_cat"]]

           Age  Age_cat
160  44.000000    Adult
161  40.000000    Adult
162  26.000000    Adult
163  17.000000    Adult
164   1.000000    Child
165   9.000000    Child
166  29.699118    Adult
167  45.000000    Adult
168  29.699118    Adult
169  28.000000    Adult
170  61.000000  Elderly
171   4.000000    Child
172   1.000000    Child
173  21.000000    Adult
174  56.000000    Adult
175  18.000000    Adult

In [53]:
def get_category(age):       
    cat=""
    if age<=15: cat="baby"
    elif age<=12: cat="Child"
    elif age<=18: cat="Teenager"
    elif age<=25: cat="Student"
    elif age<=35: cat="Young Adult"
    elif age<=60: cat="Adult"
    else: cat="Elderly"  
    return cat

df["Age_cat2"] = df["Age"].apply(  람다작성 )
df[["Age","Age_cat", "Age_cat2"]].head()

    Age Age_cat     Age_cat2
0  22.0   Adult      Student
1  38.0   Adult        Adult
2  26.0   Adult  Young Adult
3  35.0   Adult  Young Adult
4  35.0   Adult  Young Adult